const sum = require('./sum');
// 1 + 2 เท่ากับ 3
test('1 + 2 เท่ากับ 3', ()=> {
  expect(sum(1,2)).toBe(3);
});

// 20 + 1 เท่ากับ 21
test('20 + 1 เท่ากับ 21', ()=> {
  expect(sum(20,1)).toBe(21);
});

// 2 + 5 เท่ากับ ?
test('2 + 5 เท่ากับ 7', ()=> {
  expect(sum(2,5)).toBe(7);
});

// ทำอีก 3 อัน โดยการพิมพ์เอง อย่า copy

test('102 + 38 เท่ากับ 140', ()=> {
  expect(sum(102,38)).toBe(140);
});

test('57 + 251 เท่ากับ 308', ()=> {
  expect(sum(57,251)).toBe(308);
});

test('428 + 451 เท่ากับ 879', ()=>{
expect(sum(428,451)).toBe(879);
});